Repository: AndreRH/hangover
Catalog: libiconv/po/*.po
Languages: ru

source: Usage: iconv [-c] [-s] [-f fromcode] [-t tocode] [file ...]
ru: Использование: iconv [-c] [-s] [-f вх_кодировка] [-t вых_кодировка] [файл …]

source: or: iconv -l
ru: или: iconv -l

source: Try '%s --help' for more information.
ru: По команде «%s --help» можно получить дополнительную информацию.

source: Usage: %s [OPTION...] [-f ENCODING] [-t ENCODING] [INPUTFILE...]
ru: Использование: %s [ПАРАМЕТР…] [-f КОДИРОВКА] [-t КОДИРОВКА] [ВХОДНОЙ_ФАЙЛ…]

source: or: %s -l
ru: или: %s -l

source: Converts text from one encoding to another encoding.
ru: Преобразует текст из одной кодировки в другую.

source: Options controlling the input and output format:
ru: Параметры управления входным и выходным форматом:

source: -f ENCODING, --from-code=ENCODING the encoding of the input
ru: -f КОДИРОВКА, --from-code=КОДИРОВКА кодировка входных данных

source: -t ENCODING, --to-code=ENCODING the encoding of the output
ru: -t КОДИРОВКА, --to-code=КОДИРОВКА кодировка выходных данных

source: Options controlling conversion problems:
ru: Параметры управления проблемами преобразования:

source: -c discard unconvertible characters
ru: -c отбрасывать непреобразующиеся символы

source: --unicode-subst=FORMATSTRING substitution for unconvertible Unicode characters
ru: --unicode-subst=СТРОКА_ФОРМАТА замена для непреобразующихся символов Юникода

source: --byte-subst=FORMATSTRING substitution for unconvertible bytes
ru: --byte-subst=СТРОКА_ФОРМАТА замена для непреобразующихся байт

source: --widechar-subst=FORMATSTRING substitution for unconvertible wide characters
ru: --widechar-subst=СТРОКА_ФОРМАТА замена для непреобразующихся широких символов

source: Options controlling error output:
ru: Параметры управления выводимыми ошибками:

source: -s, --silent suppress error messages about conversion problems
ru: -s, --silent не выводить ошибки о проблемах с преобразованием

source: Informative output:
ru: Вывод информации:

source: -l, --list list the supported encodings
ru: -l, --list список поддерживаемых кодировок

source: --help display this help and exit
ru: --help показать эту справку и выйти

source: --version output version information and exit
ru: --version показать информацию о версии и выйти

source: Report bugs to <bug-gnu-libiconv@gnu.org>.
ru: Об ошибках сообщайте по адресу <bug-gnu-libiconv@gnu.org>.

source: Written by %s.
ru: Авторы: %s.

source: %s argument: A format directive with a variable width is not allowed here.
ru: аргумент %s: Здесь не допускается директива форматирования переменной ширины.

source: %s argument: A format directive with a variable precision is not allowed here.
ru: аргумент %s: Здесь не допускается директива форматирования переменной точности.

source: %s argument: A format directive with a size is not allowed here.
ru: аргумент %s: Здесь не допускается директива размера.

source: %s argument: The string ends in the middle of a directive.
ru: аргумент %s: Строка заканчивается на середине директивы.

source: %s argument: The character '%c' is not a valid conversion specifier.
ru: аргумент %s: Символ «%c» не является верным спецификатором преобразования.

source: %s argument: The character that terminates the format directive is not a valid conversion specifier.
ru: аргумент %s: Символ, завершающий директиву форматирования, не является верным спецификатором преобразования.

source: %s argument: The format string consumes more than one argument: %u argument.
ru: аргумент %s: Строка формата задействует более одного аргумента: %u аргумент.

source: cannot convert byte substitution to Unicode: %s
ru: невозможно преобразовать байтовую подстановку в Юникод: %s

source: cannot convert unicode substitution to target encoding: %s
ru: невозможно преобразовать юникодную подстановку в целевую кодировку: %s

source: cannot convert byte substitution to wide string: %s
ru: невозможно преобразовать байтовую подстановку в широкую строку: %s

source: cannot convert widechar substitution to target encoding: %s
ru: невозможно преобразовать широкосимвольную подстановку в целевую кодировку: %s

source: cannot convert byte substitution to target encoding: %s
ru: невозможно преобразовать байтовую подстановку в целевую кодировку: %s

source: %s:%u:%u: cannot convert
ru: %s:%u:%u: невозможно преобразовать

source: %s:%u:%u: incomplete character or shift sequence
ru: %s:%u:%u: неполный символ или последовательность сдвига

source: %s: I/O error
ru: %s: ошибка ввода-вывода

source: conversion from %s unsupported
ru: преобразование из %s не поддерживается

source: conversion to %s unsupported
ru: преобразование в %s не поддерживается

source: conversion from %s to %s unsupported
ru: преобразование из %s в %s не поддерживается

source: try '%s -l' to get the list of supported encodings
ru: список поддерживаемых кодировок доступен по команде «%s -l»

source: I/O error
ru: ошибка ввода-вывода
